const content = `
   
    <p>Российская Федерация, город Санкт-Петербург</p>
    <p>Редакция: ПОДПТ-271221</p>
    <p>Дата размещения оферты в данной редакции: 27.12.2021 г. </p>
    <p>Дата вступления оферты в силу: 01.01.2022 г.</p>
    <p>Данный документ является предложением (далее Оферта) от лица Общества с ограниченной ответственностью «РАТ», именуемого в дальнейшем Поставщик, заключить договор поставки товара покупателям – юридическим и физическим лицам, зарегистрированными в установленном в Российском Федерации порядке, приобретающими товар для использования исключительно в целях коммерческой деятельности (далее договор), на следующих условиях:
    </p>
    <ol>
        <li>
            ОБЩИЕ ПОЛОЖЕНИЯ.
            <ul>
                <li>
                    a. Согласием с условиями Оферты (безусловным акцептом) является факт регистрации Покупателя на сайте Поставщика <a href="#">www.td-auto.ru</a>
                </li>
                <li>
                    b. С целью заказа и поставки Товара Покупатель регистрируется на сайте Поставщика <a href="#">www.td-auto.ru</a> предоставляя информацию и документы в соответствии с настоящим Договором. При регистрации на сайте Покупателю создается Личный кабинет, через который происходит взаимодействие Покупателя и Поставщика по поводу исполнения Договора, в том числе заказ Товара. При регистрации Покупателю предоставляются логин и пароль для входа в Личный кабинет. Любые действия с использованием Личного кабинета, логина и пароля Покупателя (в том числе платежи, заказ и получение Товара) приравниваются к соответствующим действиям самого Покупателя. Покупатель несет ответственность за действия лиц, которым передал логин и пароль, и обязуется незамедлительно уведомлять Поставщика, если логин и пароль станут доступны
                </li>
                <li>
                    c. Lorem ipsum dolor sit, amet consectetur adipisicing elit. Maxime iure earum dicta quidem ipsam nostrum necessitatibus deserunt provident ut repellat. Quae fugit cum maxime asperiores, quibusdam esse quod, officia aliquid ipsum soluta incidunt distinctio. Adipisci, nulla accusantium! Fugiat, sint corrupti.  Lorem ipsum dolor sit amet consectetur adipisicing elit. Rem cupiditate magnam blanditiis laborum dolor dolore tempore tempora sunt deserunt eveniet officiis cumque, veniam quas reprehenderit sequi debitis inventore quos eum.
                </li>
            </ul>
        </li>
    </ol>
    

`;

export default content;
