import car from "@/assets/images/car.svg";


export const data = [
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
    linkSeeAll: {
      text: "Показать все",
      link: "/all-items"
    }
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
    linkSeeAll: {
      text: "Показать все",
      link: "/all-items"
    }
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
    linkSeeAll: {
      text: "Показать все",
      link: "/all-items"
    }
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
  {
    img: car,
    title: "Шины, диски, колпаки",
    links: [
      {text: "Колеса в сборе", link: "Колеса в сборе"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Колесный крепеж, метизы", link: "Колесный крепеж, метизы"},
      {text: "Камеры", link: "Камерые"},
      {text: "Колпаки", link: "Колпаки"},
      {text: "Материалы для шиномонтажа", link: "Материалы для шиномонтажа"},
      {text: "Камеры", link: "Камеры"},
    ],
  },
]